In [2]:
import pandas as pd

## Airlines-Code

In [7]:
airlines=pd.read_csv("airlines.csv")
airlines.head(5)

,Airline ID,Name,Alias,IATA,ICAO,Callsign,Country,Active
0,-1,Unknown,\N,-,NaN,\N,\N,Y
1,1,Private flight,\N,-,NaN,NaN,NaN,Y
2,2,135 Airways,\N,NaN,GNL,GENERAL,United States,N
3,3,1Time Airline,\N,1T,RNX,NEXTIME,South Africa,Y
4,4,2 Sqn No 1 Elementary Flying Training School,\N,NaN,WYT,NaN,United Kingdom,N

In [8]:
airlines.shape

(6162, 8)

In [9]:
airlines=airlines[airlines['IATA']>'00']
airlines=airlines[['Name', 'IATA', 'ICAO', 'Callsign', 'Country']]

In [10]:
airlines.shape

(1525, 5)

In [11]:
#airlines.drop_duplicates()
#airlines.shape

In [12]:
airlines.head()

                    Name IATA ICAO  Callsign        Country
3          1Time Airline   1T  RNX   NEXTIME   South Africa
10           40-Mile Air   Q5  MLA  MILE-AIR  United States
13      Ansett Australia   AN  AAA    ANSETT      Australia
14  Abacus International   1B  NaN       NaN      Singapore
15       Abelag Aviation   W9  AAB       ABG        Belgium

In [13]:
airlines.to_csv('ready_2_USE/airlines.csv', index=False) #gz', compression='gzip')

## Airport-codes

In [14]:
airport=pd.read_csv("airport-codes_csv.csv")
airport.head(5)

,ident,type,name,elevation_ft,continent,iso_country,iso_region,municipality,gps_code,iata_code,local_code,coordinates
0,00A,heliport,Total Rf Heliport,11.0,NaN,US,US-PA,Bensalem,00A,NaN,00A,"-74.93360137939453, 40.07080078125"
1,00AA,small_airport,Aero B Ranch Airport,3435.0,NaN,US,US-KS,Leoti,00AA,NaN,00AA,"-101.473911, 38.704022"
2,00AK,small_airport,Lowell Field,450.0,NaN,US,US-AK,Anchor Point,00AK,NaN,00AK,"-151.695999146, 59.94919968"
3,00AL,small_airport,Epps Airpark,820.0,NaN,US,US-AL,Harvest,00AL,NaN,00AL,"-86.77030181884766, 34.86479949951172"
4,00AR,closed,Newport Hospital & Clinic Heliport,237.0,NaN,US,US-AR,Newport,NaN,NaN,NaN,"-91.254898, 35.6087"

In [15]:
airport=airport[["type", "name", "municipality", "iata_code"]]
airport.shape

(55075, 4)

In [16]:
airport=airport.drop_duplicates()
airport.shape

(54753, 4)

In [17]:
# Filtering for only iota codes used in the fact table.
airport_dict=pd.read_csv("airport_dict.csv", sep="=", names=["iata_code","full name"], skipinitialspace=True)
airport_dict.head(3)

  iata_code                         full name
0   'ALC'\t        \t'ALCAN, AK             '
1   'ANC'\t        \t'ANCHORAGE, AK         '
2   'BAR'\t  \t'BAKER AAF - BAKER ISLAND, AK'

In [18]:
# cleaning the dictionary 
airport_dict['iata_code']=airport_dict['iata_code'].str[1:].str[:3]
airport_dict['full name']=airport_dict['full name'].str[2:].str[:-1]
airport_dict.head(3)

  iata_code                     full name
0       ALC        ALCAN, AK
1       ANC        ANCHORAGE, AK
2       BAR  BAKER AAF - BAKER ISLAND, AK

In [19]:
print(airport.shape)
airport_set=set(airport_dict.iata_code)
airport=airport[airport["iata_code"].isin(airport_set)]
#airport.rename(columns={"municipality","City"})
print(airport.shape)
airport.head()

(54753, 4)
(556, 4)

,type,name,municipality,iata_code
6055,seaplane_base,Tokeen Seaplane Base,Tokeen,TKI
6731,seaplane_base,Lake Brooks Seaplane Base,Katmai National Park,BKF
8976,small_airport,Maxson Airfield,Alexandria Bay,AXB
10441,small_airport,Fera/Maringe Airport,Fera Island,FRE
10695,small_airport,Angus Downs Airport,Angus Downs Station,ANZ

In [20]:
airport.to_csv('ready_2_USE/airportdf.csv', index=False) #gz', compression='gzip')

## US cities

In [21]:
cites=pd.read_csv("us-cities-demographics.csv",sep=";")
cites.head()

,City,State,Median Age,Male Population,Female Population,Total Population,Number of Veterans,Foreign-born,Average Household Size,State Code,Race,Count
0,Silver Spring,Maryland,33.8,40601.0,41862.0,82463,1562.0,30908.0,2.60,MD,Hispanic or Latino,25924
1,Quincy,Massachusetts,41.0,44129.0,49500.0,93629,4147.0,32935.0,2.39,MA,White,58723
2,Hoover,Alabama,38.5,38040.0,46799.0,84839,4819.0,8229.0,2.58,AL,Asian,4759
3,Rancho Cucamonga,California,34.5,88127.0,87105.0,175232,5821.0,33878.0,3.18,CA,Black or African-American,24437
4,Newark,New Jersey,34.6,138040.0,143873.0,281913,5829.0,86253.0,2.73,NJ,White,76402

In [22]:
cites=cites[["City", "State","Median Age","Total Population","Foreign-born","Average Household Size"]]
cites.head()

,City,State,Median Age,Total Population,Foreign-born,Average Household Size
0,Silver Spring,Maryland,33.8,82463,30908.0,2.60
1,Quincy,Massachusetts,41.0,93629,32935.0,2.39
2,Hoover,Alabama,38.5,84839,8229.0,2.58
3,Rancho Cucamonga,California,34.5,175232,33878.0,3.18
4,Newark,New Jersey,34.6,281913,86253.0,2.73

In [23]:
print(cites.shape)
cites=cites.drop_duplicates()
print(cites.shape)

(2891, 6)
(596, 6)

In [24]:
# remove any row not used in the airport database...

municipality=set(airport.municipality)
print(cites.shape)
cites=cites[cites.City.isin(municipality)]
print(cites.shape)
cites.head()

(596, 6)
(112, 6)

,City,State,Median Age,Total Population,Foreign-born,Average Household Size
5,Peoria,Illinois,33.1,118661,7517.0,2.40
13,Wichita,Kansas,34.6,389955,40270.0,2.56
15,Fort Myers,Florida,37.3,74015,15365.0,2.45
16,Pittsburgh,Pennsylvania,32.9,304385,28187.0,2.13
36,Salt Lake City,Utah,32.1,192660,32166.0,2.38

In [25]:
cites.to_csv('ready_2_USE/city.csv', index=False) #gz', compression='gzip')

,Country,Cost of Living Index,Rent Index,Cost of Living Plus Rent Index,Groceries Index,Restaurant Price Index,Local Purchasing Power Index
0,Switzerland,122.40,50.25,87.89,120.27,123.01,119.53
1,Norway,101.43,36.15,70.21,91.14,109.28,88.38
2,Iceland,100.48,46.95,74.88,86.89,113.74,79.44
3,Japan,83.35,25.97,55.90,81.82,48.95,87.28
4,Denmark,83.00,31.92,58.57,61.74,100.75,100.88

(132, 4)

       Country  Cost of Living Index  Rent Index  Restaurant Price Index
0  SWITZERLAND                122.40       50.25                  123.01
1       NORWAY                101.43       36.15                  109.28
2      ICELAND                100.48       46.95                  113.74
3        JAPAN                 83.35       25.97                   48.95
4      DENMARK                 83.00       31.92                  100.75

#### Removing Countries not on country_dict (used in the Fact table).

## Create Country Dict

In [8]:
country_dict=pd.read_csv("country_dict.csv", sep="=", names=["code","country name"], skipinitialspace=True)
country_set['country name']=country_set['country name'].str[1:].str[:-1]
country_set['country name']=country_set['country name'].str.upper()
country_set.head(3)

NameError: name 'country_set' is not defined

In [17]:
country_dict=pd.read_csv("country_dict.csv", sep="=", names=["code","country name"], skipinitialspace=True)

country_dict.head()

   code   country name
0   582       'MEXICO'
1   236  'AFGHANISTAN'
2   101      'ALBANIA'
3   316      'ALGERIA'
4   102      'ANDORRA'

In [18]:
country_dict['country name']=country_dict['country name'].str[1:].str[:-1]
country_dict['country name']=country_dict['country name'].str.upper()
country_dict.head(3)

   code country name
0   582       MEXICO
1   236  AFGHANISTAN
2   101      ALBANIA

In [21]:
print(country_dict.shape)
country_set=set(country_dict['country name'])
print(len(country_set))

(289, 2)
287

In [22]:
country_dict.to_csv('ready_2_USE/country_dict.csv', index=False) #gz', compression='gzip')

In [9]:
def country_dict():
    country_dict=pd.read_csv("country_dict.csv", sep="=", names=["code","country"], skipinitialspace=True)
    print(country_dict.head(2))
    country_dict['country']=country_dict['country'].str[1:].str[:-1]
    country_dict['country']=country_dict['country'].str.upper()
    print(country_dict.head(2))
    country_dict.to_csv('ready_2_USE/country_dict.csv', index=False)
country_dict()

   code        country
0   582       'MEXICO'
1   236  'AFGHANISTAN'
   code      country
0   582       MEXICO
1   236  AFGHANISTAN

## Country Datasets

### Cost of Living

In [14]:
cost=pd.read_csv("country_dataset/Cost of living index by country 2020.csv")

In [15]:
cost.head()

,Country,Cost of Living Index,Rent Index,Cost of Living Plus Rent Index,Groceries Index,Restaurant Price Index,Local Purchasing Power Index
0,Switzerland,122.40,50.25,87.89,120.27,123.01,119.53
1,Norway,101.43,36.15,70.21,91.14,109.28,88.38
2,Iceland,100.48,46.95,74.88,86.89,113.74,79.44
3,Japan,83.35,25.97,55.90,81.82,48.95,87.28
4,Denmark,83.00,31.92,58.57,61.74,100.75,100.88

In [16]:
cost=cost[["Country", "Cost of Living Index","Rent Index","Restaurant Price Index"]]
print(cost.shape)
cost['Country']=cost['Country'].str.upper()
cost.head()

(132, 4)

       Country  Cost of Living Index  Rent Index  Restaurant Price Index
0  SWITZERLAND                122.40       50.25                  123.01
1       NORWAY                101.43       36.15                  109.28
2      ICELAND                100.48       46.95                  113.74
3        JAPAN                 83.35       25.97                   48.95
4      DENMARK                 83.00       31.92                  100.75

In [30]:
# Not on the fact table.... checking for quality...
country_set=set(country_dict['country name'])
cost_=cost[~cost.Country.isin(country_set)]
print(cost_.shape)
cost_

(2, 4)

     Country  Cost of Living Index  Rent Index  Restaurant Price Index
58  CAMBODIA                 47.49       14.90                   25.19
74   MYANMAR                 42.11       23.78                   19.04

In [31]:
# removing not used countries
cost=cost[cost.Country.isin(country_set)]
print(cost.shape)
cost.head()

(130, 4)

       Country  Cost of Living Index  Rent Index  Restaurant Price Index
0  SWITZERLAND                122.40       50.25                  123.01
1       NORWAY                101.43       36.15                  109.28
2      ICELAND                100.48       46.95                  113.74
3        JAPAN                 83.35       25.97                   48.95
4      DENMARK                 83.00       31.92                  100.75

In [32]:
cost.to_csv('ready_2_USE/cost.csv', index=False) #gz', compression='gzip')

In [17]:
def country_cost():
    cost=pd.read_csv("country_dataset/Cost of living index by country 2020.csv")
    cost=cost[["Country", "Cost of Living Index","Rent Index","Restaurant Price Index"]]
    cost['Country']=cost['Country'].str.upper()
    country_dict=pd.read_csv('ready_2_USE/country_dict.csv')
    country_set=set(country_dict['country']) 
    
    cost=cost[cost.Country.isin(country_set)]
    cost.to_csv('ready_2_USE/cost.csv', index=False)
country_cost()

## Country Age

In [33]:
age=pd.read_csv('country_dataset/Coutries age structure.csv')

In [34]:
age['Country']=age['Country'].str.upper()
age.head()

    Country Age 0 to 14 Years Age 15 to 64 Years Age above 65 Years
0     JAPAN            12.90%             60.10%                27%
1     ITALY            13.50%             63.50%                23%
2  PORTUGAL            13.60%             64.90%                22%
3   GERMANY            13.10%             65.50%                22%
4   FINLAND            16.40%             62.40%                21%

In [35]:
# removing not used countries
print(age.shape)
age=age[age.Country.isin(country_set)]
print(age.shape)
age.head()

(191, 4)
(172, 4)

    Country Age 0 to 14 Years Age 15 to 64 Years Age above 65 Years
0     JAPAN            12.90%             60.10%                27%
1     ITALY            13.50%             63.50%                23%
2  PORTUGAL            13.60%             64.90%                22%
3   GERMANY            13.10%             65.50%                22%
4   FINLAND            16.40%             62.40%                21%

In [36]:
age.to_csv('ready_2_USE/age.csv', index=False) #gz', compression='gzip')

In [18]:
def cleaning_age():
    age=pd.read_csv('country_dataset/Coutries age structure.csv')
    age['Country']=age['Country'].str.upper()
    country_dict=pd.read_csv('ready_2_USE/country_dict.csv')
    country_set=set(country_dict['country']) 
    age=age[age.Country.isin(country_set)]
    age.to_csv('ready_2_USE/age.csv', index=False)
    
cleaning_age()

## Country Crime

In [37]:
crime=pd.read_csv('country_dataset/Crime index by countries 2020.csv')

In [38]:
crime['Country']=crime['Country'].str.upper()
crime.head()

            Country  Crime Index  Safety Index
0         VENEZUELA        84.49         15.51
1  PAPUA NEW GUINEA        81.93         18.07
2      SOUTH AFRICA        77.49         22.51
3       AFGHANISTAN        76.23         23.77
4          HONDURAS        76.11         23.89

In [39]:
# removing not used countries
print(crime.shape)
crime=crime[crime.Country.isin(country_set)]
print(crime.shape)
crime.head()

(129, 3)
(127, 3)

            Country  Crime Index  Safety Index
0         VENEZUELA        84.49         15.51
1  PAPUA NEW GUINEA        81.93         18.07
2      SOUTH AFRICA        77.49         22.51
3       AFGHANISTAN        76.23         23.77
4          HONDURAS        76.11         23.89

In [40]:
crime.to_csv('ready_2_USE/crime.csv', index=False) #gz', compression='gzip')

## Country Health

In [41]:
health=pd.read_csv("country_dataset/Health care index by countries 2020.csv")

In [42]:
health['Country']=health['Country'].str.upper()
health.head()

       Country  Health Care Index  Health Care Exp. Index
0       TAIWAN              86.71                  159.66
1  SOUTH KOREA              81.97                  149.94
2        JAPAN              81.14                  148.24
3      DENMARK              80.00                  147.47
4       FRANCE              79.99                  146.81

In [43]:
# removing not used countries
print(health.shape)
health=health[health.Country.isin(country_set)]
print(health.shape)
health.head()

(93, 3)
(93, 3)

       Country  Health Care Index  Health Care Exp. Index
0       TAIWAN              86.71                  159.66
1  SOUTH KOREA              81.97                  149.94
2        JAPAN              81.14                  148.24
3      DENMARK              80.00                  147.47
4       FRANCE              79.99                  146.81

In [44]:
health.to_csv('ready_2_USE/health.csv', index=False) #gz', compression='gzip')

## Country Property Cost

In [45]:
property_cost=pd.read_csv("country_dataset/Properties price index by countries 2020.csv")

In [46]:
property_cost['Country']=property_cost['Country'].str.upper()
property_cost.head(3)

,Country,Price To Income Ratio,Gross Rental Yield City Centre,Gross Rental Yield Outside of Centre,Price To Rent Ratio City Centre,Price To Rent Ratio Outside Of City Centre,Mortgage As A Percentage Of Income,Affordability Index
0,VENEZUELA,133.29,6.22,6.45,16.08,15.49,3025.03,0.03
1,SYRIA,60.83,2.71,3.00,36.93,33.29,662.83,0.15
2,HONG KONG,47.46,1.77,1.83,56.45,54.74,303.35,0.33

In [47]:
property_cost=property_cost[["Country", "Price To Income Ratio", "Mortgage As A Percentage Of Income","Affordability Index" ]]
property_cost.head(3)

,Country,Price To Income Ratio,Mortgage As A Percentage Of Income,Affordability Index
0,VENEZUELA,133.29,3025.03,0.03
1,SYRIA,60.83,662.83,0.15
2,HONG KONG,47.46,303.35,0.33

In [48]:
# removing not used countries
print(property_cost.shape)
property_cost=property_cost[property_cost.Country.isin(country_set)]
print(property_cost.shape)
property_cost.head()

(104, 4)
(103, 4)

,Country,Price To Income Ratio,Mortgage As A Percentage Of Income,Affordability Index
0,VENEZUELA,133.29,3025.03,0.03
1,SYRIA,60.83,662.83,0.15
2,HONG KONG,47.46,303.35,0.33
4,KENYA,31.63,472.19,0.21
5,SRI LANKA,31.14,478.77,0.21

In [49]:
property_cost.to_csv('ready_2_USE/property_cost.csv', index=False) #gz', compression='gzip')

### Country Pupulation

In [50]:
population=pd.read_csv("country_dataset/Pupulation density by countries.csv")
population.rename(columns={'Country (or dependent territory)':'Country'}, inplace=True)
population['Country']=population['Country'].str.upper()
population.head()

,Rank,Country,Area km2,Area mi2,Population,Density pop./km2,Density pop./mi2,Date,Population source
0,–,MACAU,32.90,13,"6,76,100","20,550","53,224","September 30, 2019",Official quarterly estimate
1,1,MONACO,2.02,0.78,"38,300","18,960","49,106","December 31, 2018",Official estimate
2,2,SINGAPORE,722.5,279,"57,03,600","7,894","20,445","July 1, 2019",Official estimate
3,–,HONG KONG,"1,106",427,"75,00,700","6,782","17,565","December 31, 2019",Official estimate
4,–,GIBRALTAR (UK),6.8,2.6,"33,701","4,956","12,836","July 1, 2019",UN projection

In [51]:
# Removing not used rows and not relevant variables 
print(population.shape)
population=population[population.Country.isin(country_set)]
population=population[["Country", "Area km2", "Population", "Density pop./km2" ]]
#population.drop_duplicates()
print(population.shape)
population.head()

(251, 9)
(182, 4)

     Country Area km2 Population Density pop./km2
1     MONACO     2.02     38,300           18,960
2  SINGAPORE    722.5  57,03,600            7,894
3  HONG KONG    1,106  75,00,700            6,782
6    BAHRAIN      778  15,43,300            1,983
7      MALTA      315   4,93,559            1,510

In [56]:
population['Area km2']=population['Area km2'].str.replace(',','')
population['Population']=population['Population'].str.replace(',','')
population['Density pop./km2']=population['Density pop./km2'].str.replace(',','')

In [57]:
population.head()

     Country Area km2 Population Density pop./km2
1     MONACO     2.02      38300            18960
2  SINGAPORE    722.5    5703600             7894
3  HONG KONG     1106    7500700             6782
6    BAHRAIN      778    1543300             1983
7      MALTA      315     493559             1510

In [58]:
population.to_csv('ready_2_USE/population.csv', index=False) #gz', compression='gzip')

In [15]:
def cleaning_population(path_source='country_dataset/',filename_source='Pupulation density by countries.csv', path_dest='ready_2_USE/',filename_dest='population.csv' ):
    import pandas as pd
    source_file=path_source+filename_source
    dest_file=path_dest+filename_dest
    print(source_file)
    print(dest_file)
    
    country_dict=pd.read_csv('ready_2_USE/country_dict.csv')
    country_set=set(country_dict['country'])  
       
    population=pd.read_csv(source_file)#"country_dataset/Pupulation density by countries.csv")
    population.rename(columns={'Country (or dependent territory)':'Country'}, inplace=True)
   # print(country_set)
   # print(population.head(3))
    population=population[["Country", "Area km2", "Population", "Density pop./km2" ]]
    population['Country']=population['Country'].str.upper()
    population=population[population.Country.isin(country_set)]
    population['Area km2']=population['Area km2'].str.replace(',','')
    population['Population']=population['Population'].str.replace(',','')
    population['Density pop./km2']=population['Density pop./km2'].str.replace(',','')
        
    
    

    population.to_csv(dest_file, index=False)#'ready_2_USE/population.csv', index=False)
cleaning_population()

country_dataset/Pupulation density by countries.csv
ready_2_USE/population.csv

## Country Quality of Life

In [44]:
life_Quality=pd.read_csv("country_dataset/Quality of life index by countries 2020.csv")

In [45]:
life_Quality['Country']=life_Quality['Country'].str.upper()
life_Quality.head()

,Country,Quality of Life Index,Purchasing Power Index,Safety Index,Health Care Index,Cost of Living Index,Property Price to Income Ratio,Traffic Commute Time Index,Pollution Index,Climate Index
0,DENMARK,192.67,100.88,74.90,80.00,83.00,7.45,28.85,21.33,81.80
1,SWITZERLAND,192.01,119.53,78.40,72.44,122.40,8.68,29.09,22.39,79.24
2,FINLAND,190.22,99.93,76.68,75.79,70.29,8.35,29.90,11.55,58.87
3,AUSTRALIA,186.21,107.31,58.64,77.38,73.54,7.52,34.73,23.46,92.70
4,NETHERLANDS,183.67,90.73,72.38,74.65,73.75,7.51,29.43,27.41,87.61

In [46]:
# Removing not used rows and not relevant variables 
print(life_Quality.shape)
life_Quality=life_Quality[life_Quality.Country.isin(country_set)]
life_Quality=life_Quality[["Country","Quality of Life Index","Health Care Index","Pollution Index","Climate Index"]]
print(life_Quality.shape)
life_Quality.head()

(80, 10)
(80, 5)

,Country,Quality of Life Index,Health Care Index,Pollution Index,Climate Index
0,DENMARK,192.67,80.00,21.33,81.80
1,SWITZERLAND,192.01,72.44,22.39,79.24
2,FINLAND,190.22,75.79,11.55,58.87
3,AUSTRALIA,186.21,77.38,23.46,92.70
4,NETHERLANDS,183.67,74.65,27.41,87.61

In [47]:
life_Quality.to_csv('ready_2_USE/life_Quality.csv', index=False) #gz', compression='gzip')